#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.buckets.aws_s3_bucket_object.get_roles_function_object: Refreshing state... [id=lambdas/demo/get_roles_handler.zip]
module.buckets.aws_s3_bucket_object.list_scenarios_function_object: Refreshing state... [id=lambdas/demo/list_scenarios_handler.zip]
module.sql.aws_db_subnet_group.kpinetwork: Refreshing state... [id=demokpinetwork]
module.buckets.aws_s3_bucket_object.get_revenue_sum_by_company_function_object: Refreshing state... [id=lambdas/demo/get_revenue_sum_by_company_handler.zip]
module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object: Refreshing state... [id=lambdas/demo/verify_users_with_same_email_handler.zip]
module.buckets.aws_s3_bucket_object.glue_trigger_function_object: Refreshing state... [id=lambdas/demo/glue_trigger_handler.zip]
module.buckets.aws_s3_bucket_object.get_metric_by_company_id_function_object: Refreshing state... [id=lambdas/demo/get_metric_by_company_id_handler.zip]
module.buckets.aws_s3_bucket_object.get_cohorts_function_object: Refreshing state... [id=lambdas/demo/get_cohorts_handler.zip]
module.buckets.aws_s3_bucket_object.change_company_publicly_function_object: Refreshing state... [id=lambdas/demo/change_company_publicly_handler.zip]
module.buckets.aws_s3_bucket_object.get_users_function_object: Refreshing state... [id=lambdas/demo/get_users_handler.zip]
module.buckets.aws_s3_bucket_object.get_company_function_object: Refreshing state... [id=lambdas/demo/get_company_handler.zip]
module.buckets.aws_s3_bucket_object.get_average_metrics_by_cohort_function_object: Refreshing state... [id=lambdas/demo/get_average_metrics_by_cohort_handler.zip]
module.logs.aws_cloudwatch_log_group.assign_company_permissions_lambda_function: Refreshing state... [id=/aws/lambda/demo_assign_company_permissions_lambda_function]
module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object: Refreshing state... [id=lambdas/demo/add_user_to_customer_group_handler.zip]
module.network.aws_api_gateway_rest_api.api: Refreshing state... [id=kb7gblbu69]
module.buckets.aws_s3_bucket_object.get_average_metrics_function_object: Refreshing state... [id=lambdas/demo/get_average_metrics_handler.zip]
module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object: Refreshing state... [id=lambdas/demo/get_comparison_vs_peers_handler.zip]
module.buckets.aws_s3_bucket_object.get_cohort_by_id_function_object: Refreshing state... [id=lambdas/demo/get_cohort_by_id_handler.zip]
module.policy.aws_iam_role.get_company_scenarios_lambda_exec_role: Refreshing state... [id=demo_get_company_scenarios_lambda_exec_role]
module.buckets.aws_s3_bucket_object.layer_libraries_object: Refreshing state... [id=layer/demo/layer_libraries.zip]
module.logs.aws_cloudwatch_log_group.add_user_to_customer_group_lambda_function: Refreshing state... [id=/aws/lambda/demo_add_user_to_customer_group_lambda_function]
module.buckets.aws_s3_bucket_object.get_company_permissions_function_object: Refreshing state... [id=lambdas/demo/get_company_permissions_handler.zip]
module.logs.aws_cloudwatch_log_group.get_cohorts_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_cohorts_lambda_function]
module.buckets.aws_s3_bucket_object.get_revenue_sum_by_cohort_function_object: Refreshing state... [id=lambdas/demo/get_revenue_sum_by_cohort_handler.zip]
module.policy.aws_iam_role.get_comparison_vs_peers_lambda_exec_role: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.authorize_lambda_function: Refreshing state... [id=/aws/lambda/demo_authorize_lambda_function]
module.policy.aws_iam_role.get_universe_overview_lambda_exec_role: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_comparison_vs_peers_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_comparison_vs_peers_lambda_function]
module.buckets.aws_s3_bucket_object.get_universe_overview_function_object: Refreshing state... [id=lambdas/demo/get_universe_overview_handler.zip]
module.policy.aws_iam_role.get_average_metrics_lambda_exec_role: Refreshing state... [id=demo_get_average_metrics_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_metrics_by_cohort_id_function_object: Refreshing state... [id=lambdas/demo/get_metrics_by_cohort_id_handler.zip]
module.policy.aws_iam_role.get_metric_by_company_id_lambda_exec_role: Refreshing state... [id=demo_get_metric_by_company_id_lambda_exec_role]
module.policy.aws_iam_role.assign_company_permissions_lambda_exec_role: Refreshing state... [id=demo_assign_company_permissions_lambda_exec_role]
module.policy.aws_iam_role.authorize_lambda_exec_role: Refreshing state... [id=demo_authorize_lambda_exec_role]
module.policy.aws_iam_role.get_users_lambda_exec_role: Refreshing state... [id=demo_get_users_lambda_exec_role]
module.policy.aws_iam_role.get_cohort_by_id_lambda_exec_role: Refreshing state... [id=demo_get_cohort_by_id_lambda_exec_role]
module.policy.aws_iam_role.company_lambda_exec_role: Refreshing state... [id=demo_company_lambda_exec_role]
module.policy.aws_iam_role.get_revenue_sum_by_company_lambda_exec_role: Refreshing state... [id=demo_get_revenue_sum_by_company_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.verify_users_with_same_email_lambda_function: Refreshing state... [id=/aws/lambda/demo_verify_users_with_same_email_lambda_function]
module.policy.aws_iam_role.get_metrics_by_cohort_id_lambda_exec_role: Refreshing state... [id=demo_get_metrics_by_cohort_id_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object: Refreshing state... [id=lambdas/demo/get_company_report_vs_peers_handler.zip]
module.policy.aws_iam_role.get_roles_lambda_exec_role: Refreshing state... [id=demo_get_roles_lambda_exec_role]
module.policy.aws_iam_role.get_cohorts_lambda_exec_role: Refreshing state... [id=demo_get_cohorts_lambda_exec_role]
module.policy.aws_iam_role.get_scenarios_lambda_exec_role: Refreshing state... [id=demo_get_scenarios_lambda_exec_role]
module.policy.aws_iam_role.verify_users_with_same_email_lambda_exec_role: Refreshing state... [id=demo_verify_users_with_same_email_exec_role]
module.logs.aws_cloudwatch_log_group.get_scenarios_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_scenarios_lambda_function]
module.policy.aws_iam_role.get_company_report_vs_peers_lambda_exec_role: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role]
module.policy.aws_iam_role.get_company_permissions_lambda_exec_role: Refreshing state... [id=demo_get_company_permissions_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_all_companies_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_all_companies_lambda_function]
module.policy.aws_iam_policy.lambda_glue_access: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_iam_policy_lambda_glue_access]
aws_route53_zone.kpinetwork: Refreshing state... [id=Z02521762FZPW0IDM8JJO]
module.policy.aws_iam_role.glue_trigger_lambda_exec_role: Refreshing state... [id=demo_glue_trigger_lambda_exec_role]
module.policy.aws_iam_role.get_metrics_lambda_exec_role: Refreshing state... [id=demo_get_metrics_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_metrics_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_metrics_lambda_function]
module.policy.aws_iam_role.change_company_publicly_lambda_exec_role: Refreshing state... [id=demo_change_company_publicly_lambda_exec_role]
module.policy.aws_iam_role.get_user_details_lambda_exec_role: Refreshing state... [id=demo_get_user_details_lambda_exec_role]
module.policy.aws_iam_role.companies_lambda_exec_role: Refreshing state... [id=demo_companies_lambda_exec_role]
module.policy.aws_iam_role.list_scenarios_lambda_exec_role: Refreshing state... [id=demo_list_scenarios_lambda_exec_role]
module.policy.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_iam_policy_lambda_logging_function_back]
module.policy.aws_iam_role.get_cohort_scenarios_lambda_exec_role: Refreshing state... [id=demo_get_cohort_scenarios_lambda_exec_role]
module.policy.aws_iam_role.authorize_lambda_invoke_role: Refreshing state... [id=demo_authorize_lambda_invoke_role]
module.codebuild.aws_codebuild_source_credential.git_credential: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:token/github]
module.logs.aws_cloudwatch_log_group.get_cohort_by_id_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_cohort_by_id_lambda_function]
module.logs.aws_cloudwatch_log_group.codebuild_rds_migrations: Refreshing state... [id=/aws/codebuild/demo_rds_migrations]
module.logs.aws_cloudwatch_log_group.list_scenarios_lambda_function: Refreshing state... [id=/aws/lambda/demo_list_scenarios_lambda_function]
module.logs.aws_cloudwatch_log_group.get_roles_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_roles_lambda_function]
module.logs.aws_cloudwatch_log_group.get_revenue_sum_by_company_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_revenue_sum_by_company_lambda_function]
module.policy.aws_iam_role.get_average_metrics_by_cohort_lambda_exec_role: Refreshing state... [id=demo_get_average_metrics_by_cohort_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_universe_overview_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_universe_overview_lambda_function]
module.policy.aws_iam_role.get_revenue_sum_by_cohort_lambda_exec_role: Refreshing state... [id=demo_get_revenue_sum_by_cohort_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_average_metrics_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_average_metrics_lambda_function]
module.logs.aws_cloudwatch_log_group.get_user_details_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_user_details_lambda_function]
module.logs.aws_cloudwatch_log_group.get_cohort_scenarios_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_cohort_scenarios_lambda_function]
module.logs.aws_cloudwatch_log_group.get_company_scenarios_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_scenarios_lambda_function]
module.buckets.aws_s3_bucket_object.get_cohort_scenarios_function_object: Refreshing state... [id=lambdas/demo/get_cohort_scenarios_handler.zip]
module.policy.aws_lambda_permission.apigw_authorize_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.logs.aws_cloudwatch_log_group.glue_trigger_lambda_function: Refreshing state... [id=/aws/lambda/demo_glue_trigger_lambda_function]
module.buckets.aws_s3_bucket_object.get_user_details_function_object: Refreshing state... [id=lambdas/demo/get_user_details_handler.zip]
module.logs.aws_cloudwatch_log_group.get_revenue_sum_by_cohort_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_revenue_sum_by_cohort_lambda_function]
module.logs.aws_cloudwatch_log_group.get_company_report_vs_peers_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_report_vs_peers_lambda_function]
module.logs.aws_cloudwatch_log_group.get_users_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_users_lambda_function]
module.buckets.aws_s3_bucket_object.etl_script_object: Refreshing state... [id=pyspark/kpinetwork_analizer.py]
module.logs.aws_cloudwatch_log_group.get_average_metrics_by_cohort_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_average_metrics_by_cohort_lambda_function]
module.logs.aws_cloudwatch_log_group.get_company_permissions_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_permissions_lambda_function]
module.buckets.aws_s3_bucket_object.get_metrics_function_object: Refreshing state... [id=lambdas/demo/get_metrics_handler.zip]
module.policy.aws_iam_role.add_user_to_customer_group_lambda_exec_role: Refreshing state... [id=demo_add_user_to_customer_group_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_metric_by_id_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_metric_by_company_id_lambda_function]
module.logs.aws_cloudwatch_log_group.get_company_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_lambda_function]
module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object: Refreshing state... [id=lambdas/demo/assign_company_permissions_handler.zip]
module.buckets.aws_s3_bucket_object.get_all_companies_function_object: Refreshing state... [id=lambdas/demo/get_all_companies_handler.zip]
module.logs.aws_cloudwatch_log_group.get_metrics_by_cohort_id_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_metrics_by_cohort_id_lambda_function]
module.buckets.aws_s3_bucket_object.get_scenarios_function_object: Refreshing state... [id=lambdas/demo/get_scenarios_handler.zip]
module.logs.aws_cloudwatch_log_group.change_company_publicly_lambda_function: Refreshing state... [id=/aws/lambda/demo_change_company_publicly_lambda_function]
module.buckets.aws_s3_bucket_object.get_company_scenarios_function_object: Refreshing state... [id=lambdas/demo/get_company_scenarios_handler.zip]
module.buckets.aws_s3_bucket_object.authorize_function_object: Refreshing state... [id=lambdas/demo/authorize_handler.zip]
module.cert.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:435552912911:certificate/2e6953ea-c466-4ff3-baa9-7e8c3440affa]
module.sql.aws_db_instance.kpinetwork_db: Refreshing state... [id=demokpinetworkdb]
module.network.aws_api_gateway_resource.universe_overview: Refreshing state... [id=zr5b6w]
module.network.aws_api_gateway_resource.comparison_vs_peers: Refreshing state... [id=ygo84c]
module.network.aws_api_gateway_resource.metrics: Refreshing state... [id=1cyyi4]
module.network.aws_api_gateway_resource.roles: Refreshing state... [id=7w2rqf]
module.network.aws_api_gateway_resource.company_report_vs_peers: Refreshing state... [id=mlpebw]
module.network.aws_api_gateway_resource.users: Refreshing state... [id=837cdz]
module.network.aws_api_gateway_resource.companies: Refreshing state... [id=bnvar7]
module.network.aws_api_gateway_resource.scenarios: Refreshing state... [id=ifcpo2]
module.network.aws_api_gateway_resource.cohorts: Refreshing state... [id=97prpe]
module.policy.aws_iam_role_policy_attachment.company_scenarios_lambda_vpc: Refreshing state... [id=demo_get_company_scenarios_lambda_exec_role-20211111170238922300000004]
module.policy.aws_iam_role_policy_attachment.company_scenarios_lambda_logs: Refreshing state... [id=demo_get_company_scenarios_lambda_exec_role-20211111170238921300000003]
module.policy.aws_iam_role_policy_attachment.get_comparison_vs_peers_lambda_vpc: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role-20211222131917590600000002]
module.policy.aws_iam_role_policy_attachment.get_comparison_vs_peers_lambda_logs: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role-20211222131917584000000001]
module.policy.aws_iam_role_policy_attachment.get_users_lambda_vpc: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role-20220129002338871000000001]
module.policy.aws_iam_role_policy_attachment.get_universe_overview_lambda_logs: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role-20211209154733547100000001]
module.policy.aws_iam_role_policy_attachment.get_universe_overview_lambda_vpc: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role-20211209154733547200000002]
module.policy.aws_iam_role_policy_attachment.get_metric_by_id_lambda_vpc: Refreshing state... [id=demo_get_metric_by_company_id_lambda_exec_role-20211110195232341900000001]
module.policy.aws_iam_role_policy_attachment.get_metric_by_company_id_lambda_logs: Refreshing state... [id=demo_get_metric_by_company_id_lambda_exec_role-20211110195232357400000002]
module.policy.aws_iam_role_policy_attachment.get_average_metrics_lambda_vpc: Refreshing state... [id=demo_get_average_metrics_lambda_exec_role-20211122220041443600000003]
module.policy.aws_iam_role_policy_attachment.get_average_metrics_lambda_logs: Refreshing state... [id=demo_get_average_metrics_lambda_exec_role-20211122220041624400000004]
module.policy.aws_iam_role_policy_attachment.authorize_lambda_logs: Refreshing state... [id=demo_authorize_lambda_exec_role-20220113125137753300000001]
module.policy.aws_iam_role_policy_attachment.assign_company_permissions_lambda_vpc: Refreshing state... [id=demo_assign_company_permissions_lambda_exec_role-20220214140917365700000001]
module.policy.aws_iam_role_policy_attachment.assign_company_permissions_lambda_logs: Refreshing state... [id=demo_assign_company_permissions_lambda_exec_role-20220214140917367200000002]
module.policy.aws_iam_role_policy_attachment.company_lambda_vpc: Refreshing state... [id=demo_company_lambda_exec_role-20211104145749000900000003]
module.policy.aws_iam_role_policy_attachment.company_lambda_logs: Refreshing state... [id=demo_company_lambda_exec_role-20211104145749000100000002]
module.policy.aws_iam_role_policy_attachment.get_cohort_by_id_lambda_vpc: Refreshing state... [id=demo_get_cohort_by_id_lambda_exec_role-20211116152817567900000006]
module.policy.aws_iam_role_policy_attachment.get_cohort_by_id_lambda_logs: Refreshing state... [id=demo_get_cohort_by_id_lambda_exec_role-20211116152817488400000005]
module.policy.aws_iam_role_policy_attachment.get_users_lambda_logs: Refreshing state... [id=demo_get_users_lambda_exec_role-20220129002343661500000002]
module.policy.aws_iam_role_policy_attachment.get_revenue_sum_by_company_lambda_vpc: Refreshing state... [id=demo_get_revenue_sum_by_company_lambda_exec_role-20211115215557782000000001]
module.policy.aws_iam_role_policy_attachment.get_revenue_sum_by_company_lambda_logs: Refreshing state... [id=demo_get_revenue_sum_by_company_lambda_exec_role-20211115215557782400000002]
module.policy.aws_iam_role_policy_attachment.get_metrics_by_cohort_id_lambda_vpc: Refreshing state... [id=demo_get_metrics_by_cohort_id_lambda_exec_role-20211125134234097000000001]
module.policy.aws_iam_role_policy_attachment.get_metrics_by_cohort_id_lambda_logs: Refreshing state... [id=demo_get_metrics_by_cohort_id_lambda_exec_role-20211125134234575000000004]
module.policy.aws_iam_role_policy_attachment.get_cohorts_lambda_vpc: Refreshing state... [id=demo_get_cohorts_lambda_exec_role-20211116152816484600000001]
module.policy.aws_iam_role_policy_attachment.scenarios_lambda_logs: Refreshing state... [id=demo_get_scenarios_lambda_exec_role-20211125180844569300000001]
module.policy.aws_iam_role_policy_attachment.get_cohorts_lambda_logs: Refreshing state... [id=demo_get_cohorts_lambda_exec_role-20211116152816576300000002]
module.policy.aws_iam_role_policy_attachment.get_company_report_vs_peers_lambda_vpc: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role-20211217193844121400000002]
module.policy.aws_iam_role_policy_attachment.get_company_report_vs_peers_lambda_logs: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role-20211217193844110800000001]
module.policy.aws_iam_role_policy_attachment.get_roles_lambda_logs: Refreshing state... [id=demo_get_roles_lambda_exec_role-20220201183736169200000001]
module.policy.aws_iam_role_policy_attachment.verify_users_with_same_email_lambda_logs: Refreshing state... [id=demo_verify_users_with_same_email_exec_role-20220127183123476100000001]
module.policy.aws_iam_role_policy_attachment.get_company_permissions_lambda_logs: Refreshing state... [id=demo_get_company_permissions_lambda_exec_role-20220216143113047800000002]
module.policy.aws_iam_role_policy_attachment.get_company_permissions_lambda_vpc: Refreshing state... [id=demo_get_company_permissions_lambda_exec_role-20220216143113048700000003]
module.policy.aws_iam_role_policy_attachment.glue_trigger_lambda_glue_access: Refreshing state... [id=demo_glue_trigger_lambda_exec_role-20211108151916085000000001]
module.policy.aws_iam_role_policy_attachment.get_metrics_lambda_logs: Refreshing state... [id=demo_get_metrics_lambda_exec_role-20211110194402226000000002]
module.policy.aws_iam_role_policy_attachment.get_metrics_lambda_vpc: Refreshing state... [id=demo_get_metrics_lambda_exec_role-20211110194402192800000001]
module.policy.aws_iam_role_policy_attachment.glue_trigger_lambda_logs: Refreshing state... [id=demo_glue_trigger_lambda_exec_role-20211108151916088000000002]
module.policy.aws_iam_role_policy_attachment.change_company_publicly_lambda_vpc: Refreshing state... [id=demo_change_company_publicly_lambda_exec_role-20220215163304159600000002]
module.policy.aws_iam_role_policy_attachment.change_company_publicly_lambda_logs: Refreshing state... [id=demo_change_company_publicly_lambda_exec_role-20220215163304155600000001]
module.policy.aws_iam_role_policy_attachment.companies_lambda_vpc: Refreshing state... [id=demo_companies_lambda_exec_role-20211104145748993600000001]
module.policy.aws_iam_role_policy_attachment.companies_lambda_logs: Refreshing state... [id=demo_companies_lambda_exec_role-20211104145749002900000004]
module.policy.aws_iam_role_policy_attachment.list_scenarios_lambda_vpc: Refreshing state... [id=demo_list_scenarios_lambda_exec_role-20211111170238199900000002]
module.policy.aws_iam_role_policy_attachment.list_scenarios_lambda_logs: Refreshing state... [id=demo_list_scenarios_lambda_exec_role-20211111170237751100000001]
module.policy.aws_iam_role_policy_attachment.get_cohort_scenarios_lambda_logs: Refreshing state... [id=demo_get_cohort_scenarios_lambda_exec_role-20211116152817268600000004]
module.policy.aws_iam_role_policy_attachment.get_cohort_scenarios_lambda_vpc: Refreshing state... [id=demo_get_cohort_scenarios_lambda_exec_role-20211116152817033600000003]
module.policy.aws_iam_role_policy_attachment.get_user_details_lambda_vpc: Refreshing state... [id=demo_get_user_details_lambda_exec_role-20220216143110620800000001]
module.policy.aws_iam_role_policy_attachment.get_user_details_lambda_logs: Refreshing state... [id=demo_get_user_details_lambda_exec_role-20220204083752775200000001]
module.policy.aws_iam_role_policy.authorize_lambda_invoke_policy: Refreshing state... [id=demo_authorize_lambda_invoke_role:demo_authorize_lambda_invoke_policy]
module.policy.aws_iam_role_policy_attachment.get_average_metrics_by_cohort_lambda_vpc: Refreshing state... [id=demo_get_average_metrics_by_cohort_lambda_exec_role-20211125134234099900000003]
module.policy.aws_iam_role_policy_attachment.get_average_metrics_by_cohort_lambda_logs: Refreshing state... [id=demo_get_average_metrics_by_cohort_lambda_exec_role-20211125134234098900000002]
module.policy.aws_iam_role_policy_attachment.get_revenue_sum_by_cohort_lambda_vpc: Refreshing state... [id=demo_get_revenue_sum_by_cohort_lambda_exec_role-20211122220041371600000002]
module.policy.aws_iam_role_policy_attachment.get_revenue_sum_by_cohort_lambda_logs: Refreshing state... [id=demo_get_revenue_sum_by_cohort_lambda_exec_role-20211122220041296600000001]
module.policy.aws_iam_role_policy_attachment.scenarios_lambda_vpc: Refreshing state... [id=demo_get_scenarios_lambda_exec_role-20211125180844570400000002]
module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment: Refreshing state... [id=inajrr]
module.network.aws_api_gateway_resource.comparison_vs_peers_id: Refreshing state... [id=jtuqjb]
module.network.aws_api_gateway_resource.metric_cohort: Refreshing state... [id=fjgqv3]
module.network.aws_api_gateway_resource.company_metric: Refreshing state... [id=2ty0vw]
module.network.aws_api_gateway_resource.company_report_vs_peers_id: Refreshing state... [id=wycmf0]
module.network.aws_api_gateway_resource.user: Refreshing state... [id=zhsk31]
module.network.aws_api_gateway_resource.company: Refreshing state... [id=sjvaet]
module.network.aws_api_gateway_resource.change_company_publicly: Refreshing state... [id=eeb9pt]
module.network.aws_api_gateway_resource.company_revenue: Refreshing state... [id=cl0jnm]
module.network.aws_api_gateway_resource.scenario_company: Refreshing state... [id=z01lfb]
module.network.aws_api_gateway_resource.scenarios_list: Refreshing state... [id=tp2zxu]
module.policy.aws_iam_role_policy_attachment.add_user_to_customer_group_lambda_logs: Refreshing state... [id=demo_add_user_to_customer_group_lambda_exec_role-20220105181813257800000001]
module.network.aws_api_gateway_resource.cohort_revenue: Refreshing state... [id=pymy9y]
module.network.aws_api_gateway_resource.cohort: Refreshing state... [id=5k8zew]
module.functions.aws_lambda_layer_version.db_lambda_layer: Refreshing state... [id=arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:8]
module.codebuild.aws_codebuild_project.rds_migrations: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:project/demo_rds_migrations]
module.network.aws_api_gateway_resource.metric: Refreshing state... [id=k9hbzo]
module.functions.aws_lambda_function.glue_trigger_lambda_function: Refreshing state... [id=demo_glue_trigger_lambda_function]
module.network.aws_api_gateway_resource.metric_cohort_id: Refreshing state... [id=rr716m]
module.dns.aws_route53_record.cert_validations[1]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.dns.aws_route53_record.cert_validations[0]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.network.aws_api_gateway_resource.company_permissions: Refreshing state... [id=28s2ly]
module.network.aws_api_gateway_resource.scenarios_company_id: Refreshing state... [id=znsrwp]
module.network.aws_api_gateway_resource.cohort_scenarios: Refreshing state... [id=63z04b]
module.functions.aws_lambda_function.get_all_companies_lambda_function: Refreshing state... [id=demo_get_all_companies_lambda_function]
module.functions.aws_lambda_function.get_average_metrics_by_cohort_function: Refreshing state... [id=demo_get_average_metrics_by_cohort_lambda_function]
module.functions.aws_lambda_function.get_metrics_by_cohort_id_function: Refreshing state... [id=demo_get_metrics_by_cohort_id_lambda_function]
module.functions.aws_lambda_function.get_metrics_function: Refreshing state... [id=demo_get_metrics_lambda_function]
module.functions.aws_lambda_function.get_company_lambda_function: Refreshing state... [id=demo_get_company_lambda_function]
module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_function]
module.functions.aws_lambda_function.get_cohorts_function: Refreshing state... [id=demo_get_cohorts_lambda_function]
module.functions.aws_lambda_function.change_company_publicly_lambda_function: Refreshing state... [id=demo_change_company_publicly_lambda_function]
module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_function]
module.functions.aws_lambda_function.get_universe_overview_lambda_function: Refreshing state... [id=demo_get_universe_overview_lambda_function]
module.functions.aws_lambda_function.get_revenue_sum_by_company_lambda_function: Refreshing state... [id=demo_get_revenue_sum_by_company_lambda_function]
module.functions.aws_lambda_function.get_revenue_sum_by_cohort_lambda_function: Refreshing state... [id=demo_get_revenue_sum_by_cohort_lambda_function]
module.functions.aws_lambda_function.list_scenarios_lambda_function: Refreshing state... [id=demo_list_scenarios_lambda_function]
module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function: Refreshing state... [id=demo_add_user_to_customer_group_lambda_function]
module.functions.aws_lambda_function.get_cohort_by_id_function: Refreshing state... [id=demo_get_cohort_by_id_lambda_function]
module.functions.aws_lambda_function.get_scenarios_lambda_function: Refreshing state... [id=demo_get_scenarios_lambda_function]
module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function: Refreshing state... [id=demo_verify_users_with_same_email_lambda_function]
module.functions.aws_lambda_function.get_average_metrics_function: Refreshing state... [id=demo_get_average_metrics_lambda_function]
module.functions.aws_lambda_function.get_metric_by_company_id_function: Refreshing state... [id=demo_get_metric_by_company_id_lambda_function]
module.functions.aws_lambda_function.get_cohorts_scenarios_function: Refreshing state... [id=demo_get_cohort_scenarios_lambda_function]
module.functions.aws_lambda_function.get_company_scenarios_lambda_function: Refreshing state... [id=demo_get_company_scenarios_lambda_function]
module.network.aws_api_gateway_resource.average_metrics: Refreshing state... [id=ww2zcl]
module.network.aws_api_gateway_resource.cohort_metrics: Refreshing state... [id=rtzpd4]
module.network.aws_api_gateway_resource.cohort_average_metric: Refreshing state... [id=hdyvp6]
module.functions.aws_lambda_permission.glue_trigger_event_permission: Refreshing state... [id=AllowExecutionFromS3Bucket]
module.cert.aws_acm_certificate_validation.cert: Refreshing state... [id=2021-10-15 14:52:46 +0000 UTC]
module.cognito.aws_cognito_user_pool.pool: Refreshing state... [id=us-west-2_usXw4S12D]
module.functions.aws_s3_bucket_notification.files_bucket_notification: Refreshing state... [id=kpinetwork-files]
module.network.aws_api_gateway_domain_name.domain: Refreshing state... [id=api.demo.kpinetwork.com]
module.cognito.aws_lambda_permission.allow_post_confirmation_from_user_pool: Refreshing state... [id=AllowPostConfirmationFromUserPool]
module.policy.aws_lambda_permission.allow_pre_signup_from_user_pool: Refreshing state... [id=AllowPreSignUpFromUserPool]
module.cognito.aws_cognito_user_group.admin: Refreshing state... [id=us-west-2_usXw4S12D/demo_admin_group]
module.cognito.aws_cognito_user_pool_client.amplify: Refreshing state... [id=3917dpipsnpi2i8uofiovmn2jr]
module.policy.aws_iam_role_policy.get_user_details_cognito_policy: Refreshing state... [id=demo_get_user_details_lambda_exec_role:demo_get_user_details_cognito_policy]
module.policy.aws_iam_policy.add_user_to_customer_group_policy: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_post_configuration_trigger_policy]
module.policy.aws_iam_role_policy.verify_users_with_same_email_lambda_list_users_policy: Refreshing state... [id=demo_verify_users_with_same_email_exec_role:demo_verify_users_with_same_email_lambda_list_users_policy]
module.cognito.aws_cognito_user_group.customer: Refreshing state... [id=us-west-2_usXw4S12D/demo_customer_group]
module.policy.aws_iam_role_policy.authorize_lambda_get_users_and_groups: Refreshing state... [id=demo_get_users_lambda_exec_role:demo_authorize_lambda_get_users_and_groups]
module.policy.aws_iam_role_policy.get_roles_cognito_policy: Refreshing state... [id=demo_get_roles_lambda_exec_role:demo_get_roles_cognito_policy]
module.network.aws_api_gateway_base_path_mapping.domain_mapping: Refreshing state... [id=api.demo.kpinetwork.com/]
module.functions.aws_lambda_function.get_roles_lambda_function: Refreshing state... [id=demo_get_roles_lambda_function]
module.functions.aws_lambda_function.get_users_lambda_function: Refreshing state... [id=demo_get_users_lambda_function]
module.functions.aws_lambda_function.get_company_permissions_lambda_function: Refreshing state... [id=demo_get_company_permissions_lambda_function]
module.functions.aws_lambda_function.get_user_details_lambda_function: Refreshing state... [id=demo_get_user_details_lambda_function]
module.functions.aws_lambda_function.assign_company_permissions_lambda_function: Refreshing state... [id=demo_assign_company_permissions_lambda_function]
module.dns.aws_route53_record.kpinetwork_domain: Refreshing state... [id=Z02521762FZPW0IDM8JJO_api.demo.kpinetwork.com_A]
module.functions.aws_lambda_function.authorize_lambda_function: Refreshing state... [id=demo_authorize_lambda_function]
module.policy.aws_iam_role_policy_attachment.add_user_to_customer_group_lambda_cognito_policy: Refreshing state... [id=demo_add_user_to_customer_group_lambda_exec_role-20220107163139048600000001]
module.network.aws_api_gateway_authorizer.kpi_authorizer: Refreshing state... [id=3y14fs]
module.network.aws_api_gateway_method.get_average_metrics_method: Refreshing state... [id=agm-kb7gblbu69-ww2zcl-GET]
module.network.aws_api_gateway_method.get_user_details_method: Refreshing state... [id=agm-kb7gblbu69-zhsk31-GET]
module.network.aws_api_gateway_method.get_metrics_by_cohort_id_method: Refreshing state... [id=agm-kb7gblbu69-rtzpd4-GET]
module.network.aws_api_gateway_method.get_all_companies_method: Refreshing state... [id=agm-kb7gblbu69-bnvar7-GET]
module.network.aws_api_gateway_method.get_universe_overview_method: Refreshing state... [id=agm-kb7gblbu69-zr5b6w-GET]
module.network.aws_api_gateway_method.change_company_publicly_method: Refreshing state... [id=agm-kb7gblbu69-eeb9pt-PUT]
module.network.aws_api_gateway_method.get_cohort_by_id_method: Refreshing state... [id=agm-kb7gblbu69-5k8zew-GET]
module.network.aws_api_gateway_method.get_scenarios_method: Refreshing state... [id=agm-kb7gblbu69-ifcpo2-GET]
module.network.aws_api_gateway_method.get_metrics_method: Refreshing state... [id=agm-kb7gblbu69-1cyyi4-GET]
module.network.aws_api_gateway_method.get_company_permissions_method: Refreshing state... [id=agm-kb7gblbu69-28s2ly-GET]
module.network.aws_api_gateway_method.get_cohort_scenarios_method: Refreshing state... [id=agm-kb7gblbu69-63z04b-GET]
module.network.aws_api_gateway_method.get_revenue_sum_by_cohort_method: Refreshing state... [id=agm-kb7gblbu69-pymy9y-GET]
module.network.aws_api_gateway_method.get_company_report_vs_peers_method: Refreshing state... [id=agm-kb7gblbu69-wycmf0-GET]
module.network.aws_api_gateway_method.get_revenue_sum_by_company_method: Refreshing state... [id=agm-kb7gblbu69-cl0jnm-GET]
module.network.aws_api_gateway_method.get_comparison_vs_peers_method: Refreshing state... [id=agm-kb7gblbu69-jtuqjb-GET]
module.network.aws_api_gateway_method.assign_company_permissions_method: Refreshing state... [id=agm-kb7gblbu69-28s2ly-PUT]
module.network.aws_api_gateway_method.get_roles_method: Refreshing state... [id=agm-kb7gblbu69-7w2rqf-GET]
module.network.aws_api_gateway_method.list_scenarios_method: Refreshing state... [id=agm-kb7gblbu69-tp2zxu-GET]
module.network.aws_api_gateway_method.get_metric_by_company_id_method: Refreshing state... [id=agm-kb7gblbu69-k9hbzo-GET]
module.network.aws_api_gateway_method.get_company_method: Refreshing state... [id=agm-kb7gblbu69-sjvaet-GET]
module.network.aws_api_gateway_method.get_cohorts_method: Refreshing state... [id=agm-kb7gblbu69-97prpe-GET]
module.network.aws_api_gateway_method.get_company_scenarios_method: Refreshing state... [id=agm-kb7gblbu69-znsrwp-GET]
module.network.aws_api_gateway_method.get_users_method: Refreshing state... [id=agm-kb7gblbu69-837cdz-GET]
module.network.aws_api_gateway_method.get_average_metrics_by_cohort_method: Refreshing state... [id=agm-kb7gblbu69-hdyvp6-GET]
module.network.aws_api_gateway_integration.average_metrics_integration: Refreshing state... [id=agi-kb7gblbu69-ww2zcl-GET]
module.network.aws_api_gateway_integration.user_details_integration: Refreshing state... [id=agi-kb7gblbu69-zhsk31-GET]
module.network.aws_api_gateway_integration.companies_integration: Refreshing state... [id=agi-kb7gblbu69-bnvar7-GET]
module.network.aws_api_gateway_integration.metrics_by_cohort_id_integration: Refreshing state... [id=agi-kb7gblbu69-rtzpd4-GET]
module.network.aws_api_gateway_integration.universe_overview_integration: Refreshing state... [id=agi-kb7gblbu69-zr5b6w-GET]
module.network.aws_api_gateway_integration.change_company_publicly_integration: Refreshing state... [id=agi-kb7gblbu69-eeb9pt-PUT]
module.network.aws_api_gateway_integration.cohort_by_id_integration: Refreshing state... [id=agi-kb7gblbu69-5k8zew-GET]
module.network.aws_api_gateway_integration.scenarios_integration: Refreshing state... [id=agi-kb7gblbu69-ifcpo2-GET]
module.network.aws_api_gateway_integration.metrics_integration: Refreshing state... [id=agi-kb7gblbu69-1cyyi4-GET]
module.network.aws_api_gateway_integration.cohort_scenarios_integration: Refreshing state... [id=agi-kb7gblbu69-63z04b-GET]
module.network.aws_api_gateway_integration.get_company_permissions_integration: Refreshing state... [id=agi-kb7gblbu69-28s2ly-GET]
module.network.aws_api_gateway_integration.revenue_sum_by_cohort_integration: Refreshing state... [id=agi-kb7gblbu69-pymy9y-GET]
module.network.aws_api_gateway_integration.company_report_vs_peers_integration: Refreshing state... [id=agi-kb7gblbu69-wycmf0-GET]
module.network.aws_api_gateway_integration.assign_company_permissions_integration: Refreshing state... [id=agi-kb7gblbu69-28s2ly-PUT]
module.network.aws_api_gateway_integration.comparison_vs_peers_integration: Refreshing state... [id=agi-kb7gblbu69-jtuqjb-GET]
module.network.aws_api_gateway_integration.revenue_sum_by_company_integration: Refreshing state... [id=agi-kb7gblbu69-cl0jnm-GET]
module.network.aws_api_gateway_integration.get_roles_integration: Refreshing state... [id=agi-kb7gblbu69-7w2rqf-GET]
module.network.aws_api_gateway_integration.scenarios_list_integration: Refreshing state... [id=agi-kb7gblbu69-tp2zxu-GET]
module.network.aws_api_gateway_integration.metric_by_company_id_integration: Refreshing state... [id=agi-kb7gblbu69-k9hbzo-GET]
module.network.aws_api_gateway_integration.company_integration: Refreshing state... [id=agi-kb7gblbu69-sjvaet-GET]
module.network.aws_api_gateway_integration.cohorts_integration: Refreshing state... [id=agi-kb7gblbu69-97prpe-GET]
module.network.aws_api_gateway_integration.company_scenarios_integration: Refreshing state... [id=agi-kb7gblbu69-znsrwp-GET]
module.network.aws_api_gateway_integration.cohort_average_metrics_integration: Refreshing state... [id=agi-kb7gblbu69-hdyvp6-GET]
module.network.aws_api_gateway_integration.users_integration: Refreshing state... [id=agi-kb7gblbu69-837cdz-GET]
module.policy.aws_lambda_permission.apigw_get_revenue_sum_by_company_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRevenueSum]
module.policy.aws_lambda_permission.apigw_get_company_scenarios_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetCompanyScenarios]
module.policy.aws_lambda_permission.apigw_get_company_report_vs_peers_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_get_metrics_by_cohort_id_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCohortId]
module.policy.aws_lambda_permission.apigw_get_user_details_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetUserDetails]
module.policy.aws_lambda_permission.apigw_get_company_permissions_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetCompanyPermissions]
module.policy.aws_lambda_permission.apigw_get_comparison_vs_peers_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_get_cohorts_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_all_companies_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_revenue_sum_by_cohort_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRevenueSum]
module.policy.aws_lambda_permission.apigw_get_universe_overview_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_get_cohort_by_id_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_roles_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetRoles]
module.policy.aws_lambda_permission.apigw_get_metrics_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_users_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetUsers]
module.policy.aws_lambda_permission.apigw_get_cohort_scenarios_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_change_company_publicly_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayChangeCompanyPublicly]
module.policy.aws_lambda_permission.apigw_get_metric_by_company_id_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_assign_company_permissions_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_list_scenarios_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayListScenarios]
module.policy.aws_lambda_permission.apigw_get_scenarios_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetScenarios]
module.policy.aws_lambda_permission.apigw_get_company_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_average_metrics_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayAverage]
module.policy.aws_lambda_permission.apigw_get_average_metrics_by_cohort_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCohortAverage]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "d1bd63b30d2ed799d2263cf8e3d2e178" -> "7d14aee7ddbffea89999cebc26542df7"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "f0eb6a5f70d909ebe8e7afad924a89c2" -> "80449beb9af93c151fe8e28c3c0e83b8"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "733cd297717cd3945247d20fccdf2b96" -> "e2823f94d9495e1e795bc62cbcbeada9"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "e2b828f2c7a537c04d18879643c3b502" -> "647e31e446b3992f31dc58f0a3c5b046"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "d4aadccadd084adaabbae91384719738" -> "0adeb9b139fce50edca3e022596abf15"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_average_metrics_by_cohort_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_average_metrics_by_cohort_function_object" {
      ~ etag               = "1e7ea441be5ea0eb3c02be81c1466c1d" -> "2cde8e1237ffa9ceb5e5175d6a01d496"
        id                 = "lambdas/demo/get_average_metrics_by_cohort_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_average_metrics_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_average_metrics_function_object" {
      ~ etag               = "6a51d1bed7c459a92f8ce389bd539992" -> "c0a3990f5d5fc9bb8f2c30c5a392f752"
        id                 = "lambdas/demo/get_average_metrics_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_cohort_by_id_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_cohort_by_id_function_object" {
      ~ etag               = "fd778d083bcca46d2f5e37697437d224" -> "d9f33f83f8ec987416212d42fd5ac928"
        id                 = "lambdas/demo/get_cohort_by_id_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_cohort_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_cohort_scenarios_function_object" {
      ~ etag               = "9eb67cc4ebfa186bb1139b8c01f7f4b2" -> "275bb601bcbeda029503ee5fba1402ef"
        id                 = "lambdas/demo/get_cohort_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_cohorts_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_cohorts_function_object" {
      ~ etag               = "93174cc19ff1f4d5b4bd1571add757c3" -> "64412f754d4bc64739402d323e2c9f57"
        id                 = "lambdas/demo/get_cohorts_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_function_object" {
      ~ etag               = "abf6e79dbec69856d6c86603028bcc03" -> "cb6eb52d5ca7b161f58759bb5a21a7af"
        id                 = "lambdas/demo/get_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "12d8561ece2b6d9b4cc975755c205528" -> "0cd4861bfad809142729ef31086c5d9f"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "9676e5b8f33f4a258a7d1a4e57560ba7" -> "cd8e298f6c1ce03ae085faeb2731ac95"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_scenarios_function_object" {
      ~ etag               = "fb06bc9210a88c44b761c185222a1494" -> "ca36ff3d558a3fb33a6f3a849fbe4ee1"
        id                 = "lambdas/demo/get_company_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "c6a4f3a94e1b9a1f5f8626c86e4e49d1" -> "45f6a39a2a8fe9dc63020adf5693ac12"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_by_company_id_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_by_company_id_function_object" {
      ~ etag               = "4f374335064e44ec3abf69ab3bcb7748" -> "2098530e5d0a3c51248358c2bef1a33b"
        id                 = "lambdas/demo/get_metric_by_company_id_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metrics_by_cohort_id_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metrics_by_cohort_id_function_object" {
      ~ etag               = "596672ac15ccd455ef6136087eec01e9" -> "45e00809a034d0e9a927106b1d1219ae"
        id                 = "lambdas/demo/get_metrics_by_cohort_id_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metrics_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metrics_function_object" {
      ~ etag               = "32cc52ffde16a0ba3ce8bda243eb51b2" -> "87ea50b42961078f2fd438e6351e32d6"
        id                 = "lambdas/demo/get_metrics_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_revenue_sum_by_cohort_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_revenue_sum_by_cohort_function_object" {
      ~ etag               = "ebf814ea5a77dc1d1fb4004bdbd370e2" -> "067efc377e505ed82d9f2c7eaf399697"
        id                 = "lambdas/demo/get_revenue_sum_by_cohort_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_revenue_sum_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_revenue_sum_by_company_function_object" {
      ~ etag               = "0904611bf9307fb2f84da1ab9003c029" -> "4e48a9ce5ba3e459600ae4c7aafb9a20"
        id                 = "lambdas/demo/get_revenue_sum_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "34540715456154752a7514d2b08e81bf" -> "944919e71a64b9b8aa0d1d7a1a11f79f"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_scenarios_function_object" {
      ~ etag               = "febf256fcb3872b56c9fe03baad34be1" -> "be40ce420c69c4ad8f9a4beb9b2d5085"
        id                 = "lambdas/demo/get_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "682fd1b378ba0f944d47364643fc3cbe" -> "14b32252b3c0e35efd9c475ac5b7f79d"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "027a341e7357fd62c9c85a8c4b2b32d4" -> "b3dc6b182c3e37953f052d26b2d04d5a"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "cc759ccedf36a615510cf8088bb34be1" -> "8a157923735caae164f6b0aad3ed390a"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "7fe21a215620e9cae1d4d007861642e7" -> "931cded04b66c53ec5db3fcbb7db49e4"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "6a9b79641e52165df24161f37fed7743" -> "a7e376ce415d147015b612e7005460ec"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.list_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "list_scenarios_function_object" {
      ~ etag               = "349ba120d525743baeb882755d09a995" -> "f3c376da6d79b2d00b5bf28feb6da6c7"
        id                 = "lambdas/demo/list_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "48086557d6b649b95d693e585a2e7cbd" -> "322a68650226844ae64a4f0fc701597f"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-02-16T16:56:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "wnd8D8WUlG6eqe6Qf2wa+oZN39iRfa3E0e0kW1+2xOw=" -> "l93hDGpuATmBpNHZOQeG/o4xOt/YR94RzmDlI3WMFx8="
        tags                           = {}
        # (24 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-02-16T16:56:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "7R1JX70eQbubFrtPG6gcvdhXmh7tDrnmEHWc/gC3xEs=" -> "WqznaX+07mCzFRMidGNwskc6XJGHmw8pBYCohAFyydU="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-02-16T16:56:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "O+1PvaIdv6bvMC0BhbRfBmjuwouwsiNjbr4gyk14iEI=" -> "Lnr+qHJkzGyBbGDFDHpErmXwDvu4yD3jiIeFvjiAMyo="
        tags                           = {}
        # (24 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-02-16T16:56:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "hcUTKTQM7A4lixIjmbsa6jBSBudeOiyJuMrU+bosPKw=" -> "K8dGo7rxTYjgmkfanvU22LW7EO60TNu6ktALNcDU4Vg="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-02-16T16:56:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "RZ8Nd9Lzw677PnnFFPzM1qTF/z2JIfKwBQq84nGSOaM=" -> "N1pR9Xr1VP4ngPvPxd4cdx75URcSxyBwxP1/r4cDiU0="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_average_metrics_by_cohort_function will be updated in-place
  ~ resource "aws_lambda_function" "get_average_metrics_by_cohort_function" {
        id                             = "demo_get_average_metrics_by_cohort_lambda_function"
      ~ last_modified                  = "2022-02-16T16:56:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "BTG/0Kg3IAZRRpr3XQqKS64R0W34gMAUYCfnMYzmVoI=" -> "rkFVzWfTH7GclaKqKjC4h1bV2bvyUW4uofArNky/HkI="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_average_metrics_function will be updated in-place
  ~ resource "aws_lambda_function" "get_average_metrics_function" {
        id                             = "demo_get_average_metrics_lambda_function"
      ~ last_modified                  = "2022-02-16T16:56:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "jho9brKKqqWmZjPCP8A1O6jUOBOPup8xpKBCcojxDCI=" -> "8PtcxPY4DWmsmOmIeGpeSHOR2q36EwJXoL9RowpAOLg="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_cohort_by_id_function will be updated in-place
  ~ resource "aws_lambda_function" "get_cohort_by_id_function" {
        id                             = "demo_get_cohort_by_id_lambda_function"
      ~ last_modified                  = "2022-02-16T16:56:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "RaGgZYslI2ZK7fvA1SPgm1uHY7EGT45cGcWi35gKkF4=" -> "6mDfidULe25EfY6GiMbxL4JFLCIaDhOaGdRJ47lhmPw="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_cohorts_function will be updated in-place
  ~ resource "aws_lambda_function" "get_cohorts_function" {
        id                             = "demo_get_cohorts_lambda_function"
      ~ last_modified                  = "2022-02-16T16:56:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "oHhrQ6x3UWvnWheCaH6xnnKbbBFyDz2XqO16zuLfsRg=" -> "a0vvyoOM+jBxX5M4aSF7YO4r96H6NOJqDxc9aNbGnQc="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_cohorts_scenarios_function will be updated in-place
  ~ resource "aws_lambda_function" "get_cohorts_scenarios_function" {
        id                             = "demo_get_cohort_scenarios_lambda_function"
      ~ last_modified                  = "2022-02-16T16:56:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "/ywWYgO8V37W6Vf9RrlMPBLombXXv2h7WYMcrj51Neo=" -> "m+2Qk6x6caYLHU64yB93xTGQoem76CvTmqEa3vrgum8="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_lambda_function" {
        id                             = "demo_get_company_lambda_function"
      ~ last_modified                  = "2022-02-16T16:56:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "oFc5K+lO3jRQ84nuniZLuaWs67WANNfxZSSk/SugEu8=" -> "LNKGrwIMxfoyRk1+0akI3TKjUUXT+H2eU129E+h8DRg="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-02-16T16:56:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "LOC5tH0o/8IHNrtoVaL90BEus07PM+fXWGZybxzJ1WI=" -> "0RAy+tlRYgQwG7jwxKti7W8FIJrXAUf7/KKW5us8LTE="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-02-16T16:56:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "lNBYARNftPm5QIx15HSUhecWdHPbbJkW9a9qru1zb3c=" -> "V56a8D+wQ/XslqJZhKhoLffa9V5wBKn1ndtxKythEcU="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_scenarios_lambda_function" {
        id                             = "demo_get_company_scenarios_lambda_function"
      ~ last_modified                  = "2022-02-16T16:56:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "H5JSF0jHhvG+X5Xnsa+l0PCdbCjbkbDk+RYBQfXQdP8=" -> "2KMiLA70bcLz/nBb0qLILjT+P4nJdukguF2QXCJhjGw="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-02-16T16:56:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "5+n4py3dMl0EwjanGAEhlf2wrwDks9hPitFsVhfUnqU=" -> "v/LU3VkEx0nDe8J8pTAr3P7TNEYyysjJmXnGrx184zE="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_by_company_id_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_by_company_id_function" {
        id                             = "demo_get_metric_by_company_id_lambda_function"
      ~ last_modified                  = "2022-02-16T16:56:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "yyreauSrp6Afnb5z3YZPhtHZR4qq7ZvvSE58p3c7U2E=" -> "csBHval0nS9m3KMNT/3J63AqN6ik9uGlBLRL7ZC+N+4="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metrics_by_cohort_id_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metrics_by_cohort_id_function" {
        id                             = "demo_get_metrics_by_cohort_id_lambda_function"
      ~ last_modified                  = "2022-02-16T16:56:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "EwLXnlpaUeJz9cENI5GqtV53i9oGTk1sU5XLxFTMH9o=" -> "zZlFcG7YzX+oKFaJG5GrX73kk/9MuO75cG1TwEJ/rb4="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metrics_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metrics_function" {
        id                             = "demo_get_metrics_lambda_function"
      ~ last_modified                  = "2022-02-16T16:56:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "KDJlad2knJ6LzM0L/wr1Gd2Qhb+nYEHNZudpUj/FQIs=" -> "zeYToKvjEwPfwqlH9+uVk/NSX5nLwBrSjR1hjGnur+g="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_revenue_sum_by_cohort_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_revenue_sum_by_cohort_lambda_function" {
        id                             = "demo_get_revenue_sum_by_cohort_lambda_function"
      ~ last_modified                  = "2022-02-16T16:56:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "cvTHpMC/DyQ1tCHNUwN29Y3mDLSbcWs/mdeV5/14l5o=" -> "7d72rA3tXU3r/jAfES2yOPcDWNdl6jVQCeqWK/lyaVk="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_revenue_sum_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_revenue_sum_by_company_lambda_function" {
        id                             = "demo_get_revenue_sum_by_company_lambda_function"
      ~ last_modified                  = "2022-02-16T16:56:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "9PCWFPT/OK1a0YtKlRmPHX57YWXllESdZgWIXsj2rNQ=" -> "sWIw49sVWrIsMdMqn1Wt33BD0CnZE9SybYzMj72M5Sw="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-02-16T16:56:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "mjTuUsfiUn3GMzNAKRXIhtxAhiNSOuhHXG0e3Gbwd1s=" -> "ykcBwfM1rf04O4f9p/wRad09BfzQX+5hdiA+TPONG5M="
        tags                           = {}
        # (24 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_scenarios_lambda_function" {
        id                             = "demo_get_scenarios_lambda_function"
      ~ last_modified                  = "2022-02-16T16:56:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "+IAXSCsIrzg/oXsotqCH0i2CaIXgeGtsNM0u+bSZTvI=" -> "efsrP2KGPn1kUhNpN9/bHSMZqS4W40ejbsmsDdazqbw="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-02-16T16:56:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "zaiElWQ7+qwcfU7y8PVOQWUbOCHKx14bllNHZTawlkg=" -> "a1vtt3ilCdOSOZR58HS0XDPnOKmCH+NZ4CRP9//NyEk="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-02-16T16:57:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "BPC7sbQOkzCZRaxW5tlPEm0XfPPjtKo4VKDx4KOQKIw=" -> "1h2qssBrkrCPGGuVR56chr42JXTQbPdzPQQinIsZHwc="
        tags                           = {}
        # (24 unchanged attributes hidden)



      ~ vpc_config {
          ~ subnet_ids         = [
              - "subnet-0264422b45299167e",
              - "subnet-0686c52f061f7da17",
                # (1 unchanged element hidden)
            ]
            # (2 unchanged attributes hidden)
        }
        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-02-16T16:56:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "0sYd38ibxk7eITfOvX3MPaaNp5oOtZTpDvtU3g2e54E=" -> "hjWgJyBm7ZYeFhKk5msgymdCdmMqHHY0TpcnL9c7HXI="
        tags                           = {}
        # (24 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-02-16T16:56:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "+iiGNsHGBTXFr5GoXFrCnvcGzSiRtJxrxGZJ0/aOCo0=" -> "uLXzEu8Fk6nvEbU4csPOIEd0H08t9IIG/1bbvM/FMvY="
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.list_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "list_scenarios_lambda_function" {
        id                             = "demo_list_scenarios_lambda_function"
      ~ last_modified                  = "2022-02-16T16:56:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "uukB2p7CiijVNUb6/AVA+18uqz3uIuFxz5/oLMTCZXI=" -> "RXOB5nMtAAIUCuNk/4/2uGb9gzB6+3Zi4t17soXkWUY="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-02-16T16:56:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "gladKCQV4z6NflO+SSzLS4afZtAjJZgspSp+lFJED98=" -> "Q5RXCATQtt+dfqp1HD9UtDeMs24V0/VBYCMjnKwkd7s="
        tags                           = {}
        # (24 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-02-16T16:56:14Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "inajrr" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-02-16T16:56:13Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 57 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*